export const hexagram34 = {
  number: 34,
  name: "雷天大壮",
  binary: "100111",
  description: "大壮。利贞。",
  interpretation:
    "《彖》曰：大壮，大者壮也。刚以动，故壮。“大壮利贞”，大者正也。正大，而天地之情可见矣。\n《象》曰：雷在天上，大壮。君子以非礼弗履。",
  lines_interpretation: {
    "初九": "壮于趾，征凶，有孚。《象》曰：“壮于趾”，其孚穷也。",
    "九二": "贞吉。《象》曰：九二“贞吉”，以中也。",
    "九三": "小人用壮，君子用罔，贞厉。羝羊触藩，羸其角。《象》曰：“小人用壮”，君子以罔也。",
    "九四": "贞吉，悔亡。藩决不羸，壮于大舆之輹。《象》曰：“藩决不羸”，尚往也。",
    "六五": "丧羊于易，无悔。《象》曰：“丧羊于易”，位不当也。",
    "上六": "羝羊触藩，不能退，不能遂，无攸利，艰则吉。《象》曰：“不能退，不能遂”，不详也。“艰则吉”，咎不长也。"
  }
};