export const hexagram35 = {
  number: 35,
  name: "火地晋",
  binary: "101000",
  description: "晋，康侯用锡马蕃庶，昼日三接。",
  interpretation:
    "《彖》曰：晋，进也。明出地上，顺而丽乎大明，柔进而上行。是以康侯用锡马蕃庶，昼日三接也。\n《象》曰：明出地上，晋；君子以自昭明德。",
  lines_interpretation: {
    "初六": "晋如摧如，贞吉。罔孚，裕无咎。《象》曰：“晋如摧如”，独行正也。“裕无咎”。未受命也。",
    "六二": "晋如，愁如，贞吉。受兹介福于，其王母。《象》曰：“受兹介福”，以中正也。",
    "六三": "众允，悔亡。《象》曰：“众允”之志，上行也。",
    "九四": "晋如鼫鼠，贞厉。《象》曰：“鼫鼠贞厉”，位不当也。",
    "六五": "悔亡，失得，勿恤。往吉，无不利。《象》曰：“失得勿恤”，往有庆也。",
    "上九": "晋其角，维用伐邑，厉吉，无咎，贞吝。《象》曰：“维用伐邑”，道未光也。"
  }
};