export const hexagram39 = {
  number: 39,
  name: "水山蹇",
  binary: "010001",
  description: "蹇。利西南，不利东北。利见大人，贞吉。",
  interpretation:
    "《彖》曰：蹇，难也，险在前也。见险而能止，知矣哉！蹇利西南，往得中也；不利东北，其道穷也。利见大人，往有功也。当位贞吉，以正邦也。蹇之时用大矣哉！\n《象》曰：山上有水，蹇。君子以反身修德。",
  lines_interpretation: {
    "初六": "往蹇来誉。《象》曰：“往蹇来誉”，宜待也。",
    "六二": "王臣蹇蹇，匪躬之故。《象》曰：“王臣蹇蹇”，终无尤也。",
    "九三": "往蹇来反。《象》曰：“往蹇来反”，内喜之也。",
    "六四": "往蹇来连。《象》曰：“往蹇来连”，当位实也。",
    "九五": "大蹇朋来。《象》曰：“大蹇朋来”，以中节也。",
    "上六": "往蹇来硕，吉，利见大人。《象》曰：“往蹇来硕”，志在内也。“利见大人”，以従贵也。"
  }
};