export const hexagram62 = {
  number: 62,
  name: "雷山小过",
  binary: "100001",
  description: "小过。亨，利贞。可小事，不可大事。飞鸟遗之音，不宜上，宜下，大吉。",
  interpretation:
    "《彖》曰：小过，小者过而亨也。不可大事，柔得中也。可小事，未能也。飞鸟遗之音，不宜上，宜下，大吉，上逆而下顺也。\n《象》曰：山上有雷，小过。君子以行过乎恭，丧过乎哀，用过乎俭。",
  lines_interpretation: {
    "初六": "飞鸟以凶。《象》曰：飞鸟以凶，不可如何也。",
    "六二": "过其祖，遇其妣。不及其君，遇其臣，无咎。《象》曰：不及其君，臣不可过也。",
    "九三": "弗过防之，从或戕之，凶。《象》曰：从或戕之，凶如何也。",
    "九四": "无咎，弗过遇之。往厉必戒，勿用永贞。",
    "六五": "密云不雨，自我西郊。公弋取彼在穴。《象》曰：密云不雨，已上也。",
    "上六": "弗遇过之，飞鸟离之，凶，是谓灾眚。","《象》曰：弗遇过之，已亢也。"
  }
};